Revit 2027 API
BuiltInFailures.FamilyFailures.SharedParameterReplacedByBuiltInOne Property
 Shared parameter [Name] will be replaced by a built-in parameter with the same name. This may affect scheduling!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SharedParameterReplacedByBuiltInOne { get; }
Public Shared ReadOnly Property SharedParameterReplacedByBuiltInOne As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SharedParameterReplacedByBuiltInOne {
	FailureDefinitionId^ get ();
}
static member SharedParameterReplacedByBuiltInOne : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace